Repository: youtonghy/Todex_mobile
Catalog: Packages/TodexCore/Sources/TodexCore/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en, ja, ko

source: %@。示例：http://192.168.1.10:7345
en: %@. Example: http://192.168.1.10:7345
ja: %@。例：http://192.168.1.10:7345
ko: %@. 예: http://192.168.1.10:7345

source: %@。请在“配对与设备验证”中重新配对，并在后端核对随机码与公钥指纹。
en: %@. Re-pair in “Pairing & Device Verification” and check the code and key fingerprint on the backend.
ja: %@。「ペアリングとデバイス認証」で再ペアリングし、バックエンドで確認コードと公開鍵フィンガープリントを照合してください。
ko: %@. “페어링 및 기기 인증”에서 다시 페어링하고 백엔드에서 확인 코드와 공개 키 지문을 대조하세요.

source: /v1 协议已移除，请使用后端根地址
en: The /v1 protocol has been removed; use the backend root address
ja: /v1 プロトコルは削除されました。バックエンドのルートアドレスを使用してください
ko: /v1 프로토콜이 제거되었습니다. 백엔드 루트 주소를 사용하세요

source: Agent 未接受新的模型或思考深度配置
en: The Agent did not accept the new model or reasoning effort settings
ja: エージェントが新しいモデルまたは思考強度の設定を受け入れませんでした
ko: 에이전트가 새 모델 또는 사고 강도 설정을 수락하지 않았습니다

source: Backend 地址无效
en: Invalid backend address
ja: バックエンドのアドレスが無効です
ko: 백엔드 주소가 잘못되었습니다

source: Backend 未启动或地址不可达
en: The backend is not running or the address is unreachable
ja: バックエンドが起動していないか、アドレスに到達できません
ko: 백엔드가 실행 중이 아니거나 주소에 연결할 수 없습니다

source: Backend 未启动或端口错误（连接被拒绝）
en: The backend is not running or the port is wrong (connection refused)
ja: バックエンドが起動していないか、ポートが間違っています（接続拒否）
ko: 백엔드가 실행 중이 아니거나 포트가 잘못되었습니다(연결 거부됨)

source: Codex 响应缺少 result
en: Codex response is missing result
ja: Codex の応答に result がありません
ko: Codex 응답에 result가 없습니다

source: Codex 本地任务开始
en: Codex local task started
ja: Codex ローカルタスク開始
ko: Codex 로컬 작업 시작

source: HTTP 请求限制无效
en: Invalid HTTP request limit
ja: HTTP リクエスト制限が無効です
ko: HTTP 요청 제한이 잘못되었습니다

source: HTTPS 证书或 TLS 握手失败
en: HTTPS certificate or TLS handshake failed
ja: HTTPS 証明書または TLS ハンドシェイクに失敗しました
ko: HTTPS 인증서 또는 TLS 핸드셰이크 실패

source: WebSocket 地址无效
en: Invalid WebSocket address
ja: WebSocket アドレスが無効です
ko: WebSocket 주소가 잘못되었습니다

source: WebSocket 握手失败
en: WebSocket handshake failed
ja: WebSocket ハンドシェイクに失敗しました
ko: WebSocket 핸드셰이크 실패

source: WebSocket 握手失败（HTTP %lld）
en: WebSocket handshake failed (HTTP %lld)
ja: WebSocket ハンドシェイクに失敗しました（HTTP %lld）
ko: WebSocket 핸드셰이크 실패(HTTP %lld)

source: X25519 公钥无效
en: Invalid X25519 public key
ja: X25519 公開鍵が無効です
ko: X25519 공개 키가 잘못되었습니다

source: X25519 公钥长度无效
en: Invalid X25519 public key length
ja: X25519 公開鍵の長さが無効です
ko: X25519 공개 키 길이가 잘못되었습니다

source: XChaCha20 加密参数无效
en: Invalid XChaCha20 encryption parameters
ja: XChaCha20 暗号化パラメーターが無効です
ko: XChaCha20 암호화 매개변수가 잘못되었습니다

source: XChaCha20 密文或参数无效
en: Invalid XChaCha20 ciphertext or parameters
ja: XChaCha20 の暗号文またはパラメーターが無効です
ko: XChaCha20 암호문 또는 매개변수가 잘못되었습니다

source: 上下文压缩失败
en: Context compaction failed
ja: コンテキストの圧縮に失敗しました
ko: 컨텍스트 압축 실패

source: 不支持的历史加密格式
en: Unsupported history encryption format
ja: サポートされていない履歴暗号化形式です
ko: 지원하지 않는 기록 암호화 형식입니다

source: 不支持的配对版本
en: Unsupported pairing version
ja: 未対応のペアリングバージョン
ko: 지원하지 않는 페어링 버전

source: 不是有效的 TodeX 配对二维码
en: Not a valid TodeX pairing QR code
ja: 有効な TodeX ペアリング QR コードではありません
ko: 유효한 TodeX 페어링 QR 코드가 아닙니다

source: 事件流已结束，请创建新的连接
en: Event stream ended; create a new connection
ja: イベントストリームが終了しました。新しい接続を作成してください
ko: 이벤트 스트림이 종료되었습니다. 새 연결을 만드세요

source: 传输加密校验失败，请重新连接
en: Transport encryption check failed. Please reconnect.
ja: 通信の暗号化検証に失敗しました。再接続してください。
ko: 전송 암호화 검증에 실패했습니다. 다시 연결하세요.

source: 传输加密配置不匹配
en: Transport encryption settings do not match
ja: 転送暗号化の設定が一致しません
ko: 전송 암호화 설정이 일치하지 않습니다

source: 使用 API 密钥时必须填写模型
en: A model is required when using an API key
ja: API キーを使う場合はモデルが必須です
ko: API 키를 사용할 때는 모델이 필요합니다

source: 健康检查未返回有效文本
en: Health check returned no valid text
ja: ヘルスチェックが有効なテキストを返しませんでした
ko: 상태 확인에서 유효한 텍스트를 반환하지 않았습니다

source: 加密公钥无法使用：%@
en: Encryption public key unusable: %@
ja: 暗号化公開鍵を使用できません：%@
ko: 암호화 공개 키를 사용할 수 없음: %@

source: 加密失败
en: Encryption failed
ja: 暗号化に失敗しました
ko: 암호화 실패

source: 协议已废弃（/v1）
en: Deprecated protocol (/v1)
ja: 廃止されたプロトコル（/v1）
ko: 지원 중단된 프로토콜(/v1)

source: 单次最多上传 500 个历史密钥
en: At most 500 history keys can be uploaded at once
ja: 一度にアップロードできる履歴鍵は最大 500 個です
ko: 한 번에 최대 500개의 기록 키만 업로드할 수 있습니다

source: 单次最多请求 500 个历史密钥
en: At most 500 history keys can be requested at once
ja: 一度に要求できる履歴鍵は最大 500 個です
ko: 한 번에 최대 500개의 기록 키만 요청할 수 있습니다

source: 历史分页响应无效
en: Invalid history page response
ja: 履歴ページの応答が無効です
ko: 기록 페이지 응답이 잘못되었습니다

source: 历史加密信封无效
en: Invalid history encryption envelope
ja: 履歴暗号化エンベロープが無効です
ko: 기록 암호화 엔벨로프가 올바르지 않습니다

source: 历史加密帧无效
en: Invalid history encryption frame
ja: 履歴暗号化フレームが無効です
ko: 기록 암호화 프레임이 올바르지 않습니다

source: 历史加密帧格式不受支持
en: Unsupported history frame format
ja: サポートされていない履歴フレーム形式です
ko: 지원하지 않는 기록 프레임 형식입니다

source: 历史密钥分页没有前进
en: History key paging did not advance
ja: 履歴鍵のページングが進みませんでした
ko: 기록 키 페이지가 진행되지 않았습니다

source: 历史密钥分页过多
en: Too many history key pages
ja: 履歴鍵のページが多すぎます
ko: 기록 키 페이지가 너무 많습니다

source: 历史记录公钥无效
en: History public key is invalid
ja: 履歴の公開鍵が無効です
ko: 기록 공개 키가 올바르지 않습니다

source: 历史记录公钥长度无效
en: History public key has an invalid length
ja: 履歴の公開鍵の長さが無効です
ko: 기록 공개 키 길이가 올바르지 않습니다

source: 历史记录包装密钥格式无效
en: Wrapped history key is malformed
ja: ラップされた履歴キーの形式が無効です
ko: 래핑된 기록 키 형식이 올바르지 않습니다

source: 历史记录存在缺口，请重新核对
en: History has gaps; please review again
ja: 履歴に欠落があります。もう一度確認してください
ko: 기록에 누락이 있습니다. 다시 확인하세요

source: 历史记录密文认证失败
en: History ciphertext authentication failed
ja: 履歴の暗号文の認証に失敗しました
ko: 기록 암호문 인증에 실패했습니다

source: 历史记录密钥不属于当前设备
en: History key is not for this device
ja: 履歴キーはこのデバイス宛てではありません
ko: 기록 키가 이 기기용이 아닙니다

source: 历史记录密钥认证失败
en: History key authentication failed
ja: 履歴キーの認証に失敗しました
ko: 기록 키 인증에 실패했습니다

source: 历史记录密钥长度无效
en: History key has an invalid length
ja: 履歴キーの長さが無効です
ko: 기록 키 길이가 올바르지 않습니다

source: 历史记录私钥无效
en: History private key is invalid
ja: 履歴の秘密鍵が無効です
ko: 기록 개인 키가 올바르지 않습니다

source: 后端事件格式无效
en: Invalid backend event format
ja: バックエンドイベントの形式が無効です
ko: 백엔드 이벤트 형식이 유효하지 않습니다

source: 后端加密要求无效
en: Invalid backend encryption requirement
ja: バックエンドの暗号化要件が無効です
ko: 백엔드 암호화 요구 사항이 유효하지 않습니다

source: 后端历史加密响应无效，请检查后端版本
en: Invalid history encryption response from the backend. Check the backend version.
ja: バックエンドの履歴暗号化応答が無効です。バックエンドのバージョンを確認してください
ko: 백엔드의 기록 암호화 응답이 올바르지 않습니다. 백엔드 버전을 확인하세요

source: 后端响应无效
en: Invalid backend response
ja: バックエンドの応答が無効です
ko: 백엔드 응답이 유효하지 않습니다

source: 后端响应无效。请确认地址指向 TodeX 后端，且中间代理支持 WebSocket。
en: Invalid backend response. Make sure the address points to a TodeX backend and any proxy in between supports WebSocket.
ja: バックエンドの応答が無効です。アドレスが TodeX バックエンドを指しており、中継プロキシが WebSocket に対応していることを確認してください。
ko: 백엔드 응답이 유효하지 않습니다. 주소가 TodeX 백엔드를 가리키는지, 중간 프록시가 WebSocket을 지원하는지 확인하세요.

source: 后端响应过大
en: Backend response is too large
ja: バックエンドの応答が大きすぎます
ko: 백엔드 응답이 너무 큽니다

source: 后端在规定时间内没有响应。请确认设备与后端在同一网络，且防火墙放行该端口。
en: The backend did not respond in time. Make sure the device and backend are on the same network and the firewall allows the port.
ja: バックエンドが時間内に応答しませんでした。デバイスとバックエンドが同じネットワーク上にあり、ファイアウォールでポートが許可されていることを確認してください。
ko: 백엔드가 제한 시간 내에 응답하지 않았습니다. 기기와 백엔드가 같은 네트워크에 있고 방화벽에서 해당 포트를 허용하는지 확인하세요.

source: 后端地址无效
en: Invalid backend address
ja: バックエンドのアドレスが無効です
ko: 백엔드 주소가 유효하지 않습니다

source: 后端所在电脑的磁盘可用空间不足 1 GiB，暂时无法发送新消息。请清理磁盘后重试。
en: The backend computer has less than 1 GiB of free disk space, so new messages cannot be sent. Free up disk space and try again.
ja: バックエンドのコンピュータの空き容量が 1 GiB 未満のため、新しいメッセージを送信できません。ディスクを整理してから再試行してください。
ko: 백엔드 컴퓨터의 디스크 여유 공간이 1GiB 미만이라 새 메시지를 보낼 수 없습니다. 디스크를 정리한 후 다시 시도하세요.

source: 后端拒绝了加密连接，请重新配对
en: The backend rejected the encrypted connection. Pair again.
ja: バックエンドが暗号化接続を拒否しました。再ペアリングしてください
ko: 백엔드가 암호화 연결을 거부했습니다. 다시 페어링하세요

source: 后端拒绝了实时连接。请确认后端版本与应用一致，并检查反向代理是否支持 WebSocket。
en: The backend refused the live connection. Make sure the backend version matches the app and check that the reverse proxy supports WebSocket.
ja: バックエンドがリアルタイム接続を拒否しました。バックエンドのバージョンがアプリと一致しているか、リバースプロキシが WebSocket に対応しているかを確認してください。
ko: 백엔드가 실시간 연결을 거부했습니다. 백엔드 버전이 앱과 일치하는지, 리버스 프록시가 WebSocket을 지원하는지 확인하세요.

source: 后端拒绝了本机设备签名。请在“配对与设备验证”中重新申请设备验证，并在后端批准。
en: The backend rejected this device's signature. Request device verification again in “Pairing and device verification” and approve it on the backend.
ja: バックエンドがこのデバイスの署名を拒否しました。「ペアリングとデバイス認証」でデバイス認証を再申請し、バックエンドで承認してください。
ko: 백엔드가 이 기기의 서명을 거부했습니다. ‘페어링 및 기기 인증’에서 기기 인증을 다시 신청하고 백엔드에서 승인하세요.

source: 后端拒绝此操作
en: The backend rejected this action
ja: バックエンドがこの操作を拒否しました
ko: 백엔드가 이 작업을 거부했습니다

source: 后端拒绝认证，请检查令牌与配对状态
en: The backend rejected authentication; check the token and pairing status
ja: バックエンドが認証を拒否しました。トークンとペアリング状態を確認してください
ko: 백엔드가 인증을 거부했습니다. 토큰과 페어링 상태를 확인하세요

source: 后端握手验证失败
en: Backend handshake verification failed
ja: バックエンドのハンドシェイク検証に失敗しました
ko: 백엔드 핸드셰이크 검증에 실패했습니다

source: 后端操作失败
en: Backend operation failed
ja: バックエンドの操作に失敗しました
ko: 백엔드 작업에 실패했습니다

source: 后端未完成握手验证。请确认后端版本与应用一致。
en: The backend did not complete handshake verification. Make sure the backend version matches the app.
ja: バックエンドがハンドシェイク検証を完了しませんでした。バックエンドのバージョンがアプリと一致していることを確認してください。
ko: 백엔드가 핸드셰이크 검증을 완료하지 않았습니다. 백엔드 버전이 앱과 일치하는지 확인하세요.

source: 后端未返回历史密钥列表
en: The backend returned no history key list
ja: バックエンドが履歴鍵の一覧を返しませんでした
ko: 백엔드가 기록 키 목록을 반환하지 않았습니다

source: 后端未返回有效 JSON
en: The backend did not return valid JSON
ja: バックエンドが有効な JSON を返しませんでした
ko: 백엔드가 유효한 JSON을 반환하지 않았습니다

source: 后端没有提供 /v2 接口。请确认地址指向 TodeX 后端根地址，并将后端升级到最新版本。
en: The backend does not provide the /v2 API. Make sure the address points to the TodeX backend root and upgrade the backend to the latest version.
ja: バックエンドが /v2 API を提供していません。アドレスが TodeX バックエンドのルートを指していることを確認し、バックエンドを最新バージョンにアップグレードしてください。
ko: 백엔드가 /v2 API를 제공하지 않습니다. 주소가 TodeX 백엔드 루트 주소를 가리키는지 확인하고 백엔드를 최신 버전으로 업그레이드하세요.

source: 后端版本不兼容
en: Incompatible backend version
ja: バックエンドのバージョンに互換性がありません
ko: 백엔드 버전이 호환되지 않습니다

source: 后端的加密方式已变更，请重新配对
en: The backend's encryption method has changed. Please pair again.
ja: バックエンドの暗号化方式が変更されました。再度ペアリングしてください。
ko: 백엔드의 암호화 방식이 변경되었습니다. 다시 페어링하세요.

source: 后端终止了连接且不会自动重试，请检查后端配置后重新连接。
en: The backend closed the connection and will not retry automatically. Check the backend configuration and reconnect.
ja: バックエンドが接続を終了し、自動再試行は行われません。バックエンドの設定を確認してから再接続してください。
ko: 백엔드가 연결을 종료했으며 자동으로 재시도하지 않습니다. 백엔드 설정을 확인한 후 다시 연결하세요.

source: 后端要求加密连接，请重新配对
en: The backend requires an encrypted connection. Pair again.
ja: バックエンドは暗号化接続を必要とします。再ペアリングしてください
ko: 백엔드에 암호화 연결이 필요합니다. 다시 페어링하세요

source: 后端返回 HTTP %lld，请稍后重试或检查后端日志。
en: The backend returned HTTP %lld. Try again later or check the backend logs.
ja: バックエンドが HTTP %lld を返しました。しばらくしてから再試行するか、バックエンドのログを確認してください。
ko: 백엔드가 HTTP %lld을(를) 반환했습니다. 잠시 후 다시 시도하거나 백엔드 로그를 확인하세요.

source: 后端返回的传输加密信息无效，请更新后端后重新配对
en: The backend returned invalid transport encryption details. Update the backend and pair again.
ja: バックエンドが返した転送暗号化情報が無効です。バックエンドを更新してから再ペアリングしてください
ko: 백엔드가 반환한 전송 암호화 정보가 올바르지 않습니다. 백엔드를 업데이트한 후 다시 페어링하세요

source: 后端返回的传输加密公钥无效，请重新配对
en: The backend returned an invalid transport public key. Pair again.
ja: バックエンドが返した転送暗号化の公開鍵が無効です。再ペアリングしてください
ko: 백엔드가 반환한 전송 암호화 공개 키가 올바르지 않습니다. 다시 페어링하세요

source: 后端返回的供应商导出无效
en: The backend returned an invalid provider export
ja: バックエンドが返したプロバイダーのエクスポートが無効です
ko: 백엔드가 잘못된 프로바이더 내보내기를 반환했습니다

source: 后端返回的确认不是有效 JSON
en: The confirmation returned by the backend is not valid JSON
ja: バックエンドが返した確認は有効な JSON ではありません
ko: 백엔드가 반환한 확인 응답이 유효한 JSON이 아닙니다

source: 填写上下文窗口时必须同时给出最大输出
en: Max output is required when a context window is set
ja: コンテキストウィンドウを入力する場合は、最大出力も入力してください
ko: 컨텍스트 창을 입력하면 최대 출력도 함께 입력해야 합니다

source: 实时连接在建立过程中断开。请检查网络后重新连接。
en: The live connection dropped while being established. Check your network and reconnect.
ja: リアルタイム接続が確立中に切断されました。ネットワークを確認してから再接続してください。
ko: 실시간 연결이 설정 중에 끊겼습니다. 네트워크를 확인한 후 다시 연결하세요.

source: 实时连接被中断，应用会自动重连；若反复出现请检查网络或后端日志。
en: The live connection was interrupted; the app will reconnect automatically. If this keeps happening, check the network or backend logs.
ja: リアルタイム接続が中断されました。アプリは自動的に再接続します。繰り返し発生する場合は、ネットワークまたはバックエンドのログを確認してください。
ko: 실시간 연결이 중단되었습니다. 앱이 자동으로 다시 연결합니다. 반복되면 네트워크나 백엔드 로그를 확인하세요.

source: 密文认证失败
en: Ciphertext authentication failed
ja: 暗号文の認証に失敗しました
ko: 암호문 인증에 실패했습니다

source: 对话历史过长，无法导出
en: The conversation history is too long to export
ja: 会話履歴が長すぎるためエクスポートできません
ko: 대화 기록이 너무 길어 내보낼 수 없습니다

source: 导入文件不是有效的 JSON 对象
en: The import file is not a valid JSON object
ja: インポートファイルは有効な JSON オブジェクトではありません
ko: 가져올 파일이 유효한 JSON 객체가 아닙니다

source: 导入文件缺少供应商列表
en: The import file has no provider list
ja: インポートファイルにプロバイダー一覧がありません
ko: 가져올 파일에 프로바이더 목록이 없습니다

source: 导入文件过大
en: The import file is too large
ja: インポートファイルが大きすぎます
ko: 가져올 파일이 너무 큽니다

source: 已保存的加密公钥不完整或无法使用，请重新配对
en: The saved encryption key is incomplete or unusable. Pair again.
ja: 保存された暗号化公開鍵が不完全か使用できません。再ペアリングしてください
ko: 저장된 암호화 공개 키가 불완전하거나 사용할 수 없습니다. 다시 페어링하세요

source: 已停止等待，操作可能已提交
en: Stopped waiting; the action may have been submitted
ja: 待機を停止しました。操作は送信済みの可能性があります
ko: 대기를 중지했습니다. 작업이 이미 제출되었을 수 있습니다

source: 当前后端不支持设备验证，请更新后端。
en: The current backend does not support device verification; update the backend.
ja: 現在のバックエンドはデバイス認証に対応していません。バックエンドを更新してください。
ko: 현재 백엔드는 기기 인증을 지원하지 않습니다. 백엔드를 업데이트하세요.

source: 恢复密钥校验失败，请检查单词顺序与拼写
en: Recovery key checksum failed. Check the word order and spelling.
ja: 復元キーのチェックサムが一致しません。単語の順序と綴りを確認してください
ko: 복구 키 검증에 실패했습니다. 단어 순서와 철자를 확인하세요

source: 恢复密钥格式无效
en: Invalid recovery key format
ja: 復元キーの形式が無効です
ko: 복구 키 형식이 올바르지 않습니다

source: 恢复密钥需要 24 个单词，当前为 %lld 个
en: The recovery key needs 24 words; %lld entered
ja: 復元キーには 24 語が必要です（現在 %lld 語）
ko: 복구 키에는 24개 단어가 필요합니다(현재 %lld개)

source: 恢复词表损坏，请重新安装应用
en: The recovery word list is damaged. Reinstall the app.
ja: 復元単語リストが破損しています。アプリを再インストールしてください
ko: 복구 단어 목록이 손상되었습니다. 앱을 다시 설치하세요

source: 所选文件不是 TodeX 供应商导出文件
en: The selected file is not a TodeX provider export
ja: 選択したファイルは TodeX のプロバイダーエクスポートファイルではありません
ko: 선택한 파일은 TodeX 프로바이더 내보내기 파일이 아닙니다

source: 接口地址无效
en: Invalid endpoint URL
ja: エンドポイント URL が無効です
ko: 엔드포인트 URL이 올바르지 않습니다

source: 接口路径无效
en: Invalid endpoint path
ja: エンドポイントパスが無効です
ko: 엔드포인트 경로가 올바르지 않습니다

source: 接口路径转义无效
en: Invalid escaping in endpoint path
ja: エンドポイントパスのエスケープが無効です
ko: 엔드포인트 경로의 이스케이프가 올바르지 않습니다

source: 接收方公钥与标识不一致
en: The recipient's public key does not match its ID
ja: 受信者の公開鍵が ID と一致しません
ko: 수신자 공개 키가 ID와 일치하지 않습니다

source: 接收队列已满，需要补齐事件
en: Receive queue is full; events need to be backfilled
ja: 受信キューがいっぱいです。イベントの補完が必要です
ko: 수신 큐가 가득 찼습니다. 이벤트를 보충해야 합니다

source: 操作结果未知：%@。请先核对记录，避免重复执行。
en: Action result unknown: %@. Review the history first to avoid running it twice.
ja: 操作結果が不明です：%@。重複実行を避けるため、先に履歴を確認してください。
ko: 작업 결과를 알 수 없습니다: %@. 중복 실행을 피하려면 먼저 기록을 확인하세요.

source: 收到未知消息格式
en: Received an unknown message format
ja: 不明な形式のメッセージを受信しました
ko: 알 수 없는 메시지 형식을 받았습니다

source: 收到非 UTF-8 消息
en: Received a non-UTF-8 message
ja: UTF-8 以外のメッセージを受信しました
ko: UTF-8이 아닌 메시지를 받았습니다

source: 数值字段必须是正整数
en: Numeric fields must be positive integers
ja: 数値フィールドは正の整数である必要があります
ko: 숫자 필드는 양의 정수여야 합니다

source: 无效的 base64url 数据
en: Invalid base64url data
ja: 無効な base64url データです
ko: 잘못된 base64url 데이터

source: 无效的 base64url 数据或长度
en: Invalid base64url data or length
ja: base64url データまたは長さが無効です
ko: 잘못된 base64url 데이터 또는 길이

source: 无法生成安全随机数
en: Could not generate secure random bytes
ja: 安全な乱数を生成できません
ko: 안전한 난수를 생성할 수 없습니다

source: 无法解析后端主机名。请检查后端地址拼写，或改用 IP 地址。
en: Unable to resolve the backend hostname. Check the spelling of the backend address, or use an IP address instead.
ja: バックエンドのホスト名を解決できません。バックエンドアドレスの綴りを確認するか、IP アドレスを使用してください。
ko: 백엔드 호스트 이름을 확인할 수 없습니다. 백엔드 주소의 철자를 확인하거나 IP 주소를 사용하세요.

source: 服务器暂时不可用
en: Server temporarily unavailable
ja: サーバーは一時的に利用できません
ko: 서버를 일시적으로 사용할 수 없습니다

source: 未收到后端完整确认
en: Did not receive full confirmation from the backend
ja: バックエンドから完全な確認を受信していません
ko: 백엔드로부터 완전한 확인을 받지 못했습니다

source: 本地 Codex 会话已在运行
en: Local Codex session already running
ja: ローカル Codex セッションは既に実行中です
ko: 로컬 Codex 세션이 이미 실행 중입니다

source: 本地 Codex 会话未运行
en: Local Codex session is not running
ja: ローカル Codex セッションは実行されていません
ko: 로컬 Codex 세션이 실행되고 있지 않습니다

source: 本地 Codex 会话状态不可用，请停止后重试
en: Local Codex session state is unavailable; stop it and retry
ja: ローカル Codex セッションの状態が使用できません。停止して再試行してください
ko: 로컬 Codex 세션 상태를 사용할 수 없습니다. 중지 후 다시 시도하세요

source: 本地任务失败
en: Local task failed
ja: ローカルタスク失敗
ko: 로컬 작업 실패

source: 本地任务已中断
en: Local task interrupted
ja: ローカルタスク中断
ko: 로컬 작업 중단됨

source: 本地线程已失效，请重试操作
en: Local thread expired — retry the operation
ja: ローカルスレッドが失効しました。操作を再試行してください
ko: 로컬 스레드가 만료되었습니다. 작업을 다시 시도하세요

source: 本设备尚未登记历史密钥，正在重新登记，请稍后重试
en: This device hasn't registered its history key yet. Registering it again; try again shortly.
ja: このデバイスの履歴キーはまだ登録されていません。再登録しています。しばらくしてからもう一度お試しください。
ko: 이 기기의 기록 키가 아직 등록되지 않았습니다. 다시 등록하는 중이니 잠시 후 다시 시도하세요.

source: 此后端已开启会话历史端到端加密，当前客户端无法读取，请更新 TodeX 应用。
en: This backend uses end-to-end encrypted conversation history, which this client cannot read. Update the TodeX app.
ja: このバックエンドは会話履歴のエンドツーエンド暗号化を有効にしており、このクライアントでは読み取れません。TodeX アプリを更新してください。
ko: 이 백엔드는 대화 기록 종단 간 암호화를 사용하므로 현재 클라이언트로 읽을 수 없습니다. TodeX 앱을 업데이트하세요.

source: 此后端的加密公钥未经设备验证确认，请重新配对
en: This backend's encryption key was not confirmed by device verification. Pair again.
ja: このバックエンドの暗号化公開鍵はデバイス認証で確認されていません。再ペアリングしてください
ko: 이 백엔드의 암호화 공개 키는 기기 인증으로 확인되지 않았습니다. 다시 페어링하세요

source: 此设备的历史访问已被吊销，需由其他已授权设备恢复
en: This device's history access was revoked. Another authorized device must restore it.
ja: このデバイスの履歴アクセスは取り消されました。ほかの許可済みデバイスで復元する必要があります
ko: 이 기기의 기록 접근 권한이 취소되었습니다. 다른 승인된 기기에서 복원해야 합니다

source: 此连接已使用该请求 ID，请勿重复提交
en: This request ID has already been used on this connection; do not submit again
ja: このリクエスト ID はこの接続で使用済みです。重複して送信しないでください
ko: 이 요청 ID는 이 연결에서 이미 사용되었습니다. 다시 제출하지 마세요

source: 消息和附件编码后不能超过 4 MiB
en: Message and attachments can't exceed 4 MiB after encoding
ja: メッセージと添付ファイルはエンコード後 4 MiB 以下にしてください
ko: 메시지와 첨부 파일은 인코딩 후 4 MiB를 넘을 수 없습니다

source: 消息过大（%lld 字节，上限 %lld 字节），未发送
en: Message too large (%lld bytes, limit %lld bytes); not sent
ja: メッセージが大きすぎます（%lld バイト、上限 %lld バイト）。送信されませんでした
ko: 메시지가 너무 큽니다(%lld바이트, 한도 %lld바이트). 전송되지 않았습니다

source: 第 %lld 个单词“%@”不在恢复词表中
en: Word %1$lld “%2$@” is not in the recovery word list
ja: %1$lld 番目の単語「%2$@」は復元単語リストにありません
ko: %1$lld번째 단어 “%2$@”이(가) 복구 단어 목록에 없습니다

source: 等待后端响应超时
en: Timed out waiting for the backend
ja: バックエンドの応答待ちがタイムアウトしました
ko: 백엔드 응답 대기 시간이 초과되었습니다

source: 等待操作确认超时
en: Timed out waiting for action confirmation
ja: 操作確認の待機がタイムアウトしました
ko: 작업 확인 대기 시간이 초과되었습니다

source: 系统拒绝了不安全的连接
en: The system blocked an insecure connection
ja: システムが安全でない接続を拒否しました
ko: 시스템이 안전하지 않은 연결을 거부했습니다

source: 网络不可用
en: Network unavailable
ja: ネットワークを利用できません
ko: 네트워크를 사용할 수 없음

source: 设备当前没有网络连接。请检查 Wi-Fi/蜂窝网络，并确认已允许 TodeX 访问本地网络。
en: This device has no network connection. Check Wi-Fi/cellular and make sure TodeX is allowed to access the local network.
ja: デバイスがネットワークに接続されていません。Wi-Fi/モバイル通信を確認し、TodeX にローカルネットワークへのアクセスを許可していることを確認してください。
ko: 기기가 현재 네트워크에 연결되어 있지 않습니다. Wi-Fi/셀룰러를 확인하고 TodeX의 로컬 네트워크 접근을 허용했는지 확인하세요.

source: 设备未验证或凭据无效
en: Device not verified or credentials invalid
ja: デバイスが未認証か、認証情報が無効です
ko: 기기가 인증되지 않았거나 자격 증명이 유효하지 않습니다

source: 设备申请过于频繁或队列已满，请稍后重试
en: Too many device requests or the queue is full. Try again later.
ja: デバイス申請が多すぎるかキューがいっぱいです。後で再試行してください。
ko: 기기 신청이 너무 많거나 큐가 가득 찼습니다. 잠시 후 다시 시도하세요.

source: 设备验证响应无效或过大
en: Device verification response is invalid or too large
ja: デバイス認証の応答が無効か大きすぎます
ko: 기기 인증 응답이 유효하지 않거나 너무 큽니다

source: 设备验证响应状态无效
en: Invalid device verification response status
ja: デバイス認証の応答ステータスが無効です
ko: 기기 인증 응답 상태가 유효하지 않습니다

source: 设备验证失败（HTTP %@），请检查后端状态
en: Device verification failed (HTTP %@). Check the backend status.
ja: デバイス認証に失敗しました（HTTP %@）。バックエンドの状態を確認してください
ko: 기기 인증 실패(HTTP %@). 백엔드 상태를 확인하세요

source: 设备验证密文不是 UTF-8
en: Device verification ciphertext isn't valid UTF-8
ja: デバイス認証の暗号文が UTF-8 ではありません
ko: 기기 인증 암호문이 UTF-8이 아닙니다

source: 设备验证密文无效
en: Invalid device verification ciphertext
ja: デバイス認証の暗号文が無効です
ko: 기기 인증 암호문이 유효하지 않습니다

source: 设备验证密钥长度无效
en: Invalid device verification key length
ja: デバイス認証キーの長さが無効です
ko: 기기 인증 키 길이가 올바르지 않습니다

source: 设备验证操作无效
en: Invalid device verification action
ja: デバイス認証の操作が無効です
ko: 기기 인증 작업이 유효하지 않습니다

source: 设备验证正在查询，请稍候
en: Device verification is already being polled. Please wait.
ja: デバイス認証を照会中です。しばらくお待ちください
ko: 기기 인증을 조회 중입니다. 잠시 기다려 주세요

source: 设备验证申请无效或已过期，请重新申请
en: The device verification request is invalid or expired. Request again.
ja: デバイス認証の申請が無効または期限切れです。再申請してください
ko: 기기 인증 신청이 유효하지 않거나 만료되었습니다. 다시 신청하세요

source: 设备验证结果与后端的传输加密公钥不一致，请重新配对
en: The verification result does not match the backend's transport key. Pair again.
ja: 認証結果がバックエンドの転送暗号化公開鍵と一致しません。再ペアリングしてください
ko: 인증 결과가 백엔드의 전송 암호화 공개 키와 일치하지 않습니다. 다시 페어링하세요

source: 设备验证结果与本机设备密钥不匹配
en: Device verification result doesn't match this device's key
ja: デバイス認証の結果がこの端末のデバイスキーと一致しません
ko: 기기 인증 결과가 이 기기의 기기 키와 일치하지 않습니다

source: 设备验证请求未被接受，请重新申请
en: The device verification request was not accepted. Request again.
ja: デバイス認証リクエストが受け付けられませんでした。再申請してください
ko: 기기 인증 요청이 수락되지 않았습니다. 다시 신청하세요

source: 设备验证请求超时，请检查后端连接
en: Device verification request timed out. Check the backend connection.
ja: デバイス認証リクエストがタイムアウトしました。バックエンドへの接続を確認してください
ko: 기기 인증 요청 시간이 초과되었습니다. 백엔드 연결을 확인하세요

source: 该地址被 App Transport Security 拦截。请使用局域网地址或改用 HTTPS。
en: This address was blocked by App Transport Security. Use a local network address or switch to HTTPS.
ja: このアドレスは App Transport Security によりブロックされました。LAN アドレスを使用するか、HTTPS に切り替えてください。
ko: 이 주소는 App Transport Security에 의해 차단되었습니다. LAN 주소를 사용하거나 HTTPS로 변경하세요.

source: 该文件导出自 %@，与所选 Agent（%@）不一致
en: This file was exported from %@, which does not match the selected Agent (%@)
ja: このファイルは %@ からエクスポートされたもので、選択したエージェント（%@）と一致しません
ko: 이 파일은 %@에서 내보낸 것으로, 선택한 에이전트(%@)와 일치하지 않습니다

source: 请填写 http:// 或 https:// 开头的后端根地址。
en: Enter a backend root URL starting with http:// or https://.
ja: http:// または https:// で始まるバックエンドのルートアドレスを入力してください。
ko: http:// 또는 https://로 시작하는 백엔드 루트 주소를 입력하세요.

source: 请填写后端根地址，不包含接口路径
en: Enter the backend root URL without an API path
ja: API パスを含めずにバックエンドのルートアドレスを入力してください
ko: API 경로 없이 백엔드 루트 주소를 입력하세요

source: 请将后端地址改为根地址（不要包含 /v1）。
en: Change the backend address to the root URL (without /v1).
ja: バックエンドのアドレスをルートアドレスに変更してください（/v1 を含めないでください）。
ko: 백엔드 주소를 루트 주소로 변경하세요(/v1 제외).

source: 请检查后端地址与网络后重试。
en: Check the backend address and network, then try again.
ja: バックエンドのアドレスとネットワークを確認してから再試行してください。
ko: 백엔드 주소와 네트워크를 확인한 후 다시 시도하세요.

source: 请求 ID 或超时无效
en: Invalid request ID or timeout
ja: リクエスト ID またはタイムアウトが無効です
ko: 요청 ID 또는 시간 제한이 유효하지 않습니다

source: 请求内容过大（%lld 字节，上限 %lld 字节），未发送
en: Request too large (%lld bytes, limit %lld bytes); not sent
ja: リクエストが大きすぎます（%lld バイト、上限 %lld バイト）。送信されませんでした
ko: 요청이 너무 큽니다(%lld바이트, 한도 %lld바이트). 전송되지 않았습니다

source: 请确认后端已启动、地址正确且网络可达。
en: Make sure the backend is running, the address is correct, and the network is reachable.
ja: バックエンドが起動していること、アドレスが正しいこと、ネットワークに到達できることを確認してください。
ko: 백엔드가 실행 중이고 주소가 올바르며 네트워크에 연결할 수 있는지 확인하세요.

source: 请确认后端已启动，端口与地址一致，且监听地址允许局域网访问（不是仅 127.0.0.1）。
en: Make sure the backend is running, the port matches the address, and it listens on an address reachable from the LAN (not just 127.0.0.1).
ja: バックエンドが起動していること、ポートとアドレスが一致していること、待ち受けアドレスが LAN からのアクセスを許可していること（127.0.0.1 のみではないこと）を確認してください。
ko: 백엔드가 실행 중이고 포트와 주소가 일치하며 수신 주소가 LAN 접근을 허용하는지(127.0.0.1 전용이 아닌지) 확인하세요.

source: 请确认后端证书受信任且未过期；局域网调试可改用 http:// 地址。
en: Make sure the backend certificate is trusted and not expired. For LAN debugging, you can use an http:// address instead.
ja: バックエンドの証明書が信頼されていて期限切れでないことを確認してください。LAN でのデバッグには http:// アドレスを使用できます。
ko: 백엔드 인증서가 신뢰할 수 있고 만료되지 않았는지 확인하세요. LAN 디버깅에는 http:// 주소를 사용할 수 있습니다.

source: 请输入有效的 HTTP 或 HTTPS 后端地址
en: Enter a valid HTTP or HTTPS backend address
ja: 有効な HTTP または HTTPS のバックエンドアドレスを入力してください
ko: 유효한 HTTP 또는 HTTPS 백엔드 주소를 입력하세요
